MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
// Register: TX2REG
#define TX2REG TX2REG
extern volatile unsigned char           TX2REG              __at(0x492);
#ifndef _LIB_BUILD
asm("TX2REG equ 0492h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXREG                  :8;
    };
} TX2REGbits_t;
extern volatile TX2REGbits_t TX2REGbits __at(0x492);
// bitfield macros
#define _TX2REG_TXREG_POSN                                  0x0
#define _TX2REG_TXREG_POSITION                              0x0
#define _TX2REG_TXREG_SIZE                                  0x8
#define _TX2REG_TXREG_LENGTH                                0x8
#define _TX2REG_TXREG_MASK                                  0xFF

// Register: SP2BRGL
#define SP2BRGL SP2BRGL
extern volatile unsigned char           SP2BRGL             __at(0x493);
#ifndef _LIB_BUILD
asm("SP2BRGL equ 0493h");
#endif
// aliases
extern volatile unsigned char           SPBRG2              __at(0x493);
#ifndef _LIB_BUILD
asm("SPBRG2 equ 0493h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGL                 :8;
    };
} SP2BRGLbits_t;
extern volatile SP2BRGLbits_t SP2BRGLbits __at(0x493);
// bitfield macros
#define _SP2BRGL_SPBRGL_POSN                                0x0
#define _SP2BRGL_SPBRGL_POSITION                            0x0
#define _SP2BRGL_SPBRGL_SIZE                                0x8
#define _SP2BRGL_SPBRGL_LENGTH                              0x8
#define _SP2BRGL_SPBRGL_MASK                                0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SPBRGL                 :8;
    };
} SPBRG2bits_t;
extern volatile SPBRG2bits_t SPBRG2bits __at(0x493);
// bitfield macros
#define _SPBRG2_SPBRGL_POSN                                 0x0
#define _SPBRG2_SPBRGL_POSITION                             0x0
#define _SPBRG2_SPBRGL_SIZE                                 0x8
#define _SPBRG2_SPBRGL_LENGTH                               0x8
#define _SPBRG2_SPBRGL_MASK                                 0xFF

// Register: SP2BRGH
#define SP2BRGH SP2BRGH
extern volatile unsigned char           SP2BRGH             __at(0x494);
#ifndef _LIB_BUILD
asm("SP2BRGH equ 0494h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH                 :8;
    };
} SP2BRGHbits_t;
extern volatile SP2BRGHbits_t SP2BRGHbits __at(0x494);
// bitfield macros
#define _SP2BRGH_SPBRGH_POSN                                0x0
#define _SP2BRGH_SPBRGH_POSITION                            0x0
#define _SP2BRGH_SPBRGH_SIZE                                0x8
#define _SP2BRGH_SPBRGH_LENGTH                              0x8
#define _SP2BRGH_SPBRGH_MASK                                0xFF

// Register: RC2STA
#define RC2STA RC2STA
extern volatile unsigned char           RC2STA              __at(0x495);
#ifndef _LIB_BUILD
asm("RC2STA equ 0495h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC2STAbits_t;
extern volatile RC2STAbits_t RC2STAbits __at(0x495);
// bitfield macros
#define _RC2STA_RX9D_POSN                                   0x0
#define _RC2STA_RX9D_POSITION                               0x0
#define _RC2STA_RX9D_SIZE                                   0x1
#define _RC2STA_RX9D_LENGTH                                 0x1
#define _RC2STA_RX9D_MASK                                   0x1
#define _RC2STA_OERR_POSN                                   0x1
#define _RC2STA_OERR_POSITION                               0x1
#define _RC2STA_OERR_SIZE                                   0x1
#define _RC2STA_OERR_LENGTH                                 0x1
#define _RC2STA_OERR_MASK                                   0x2
#define _RC2STA_FERR_POSN                                   0x2
#define _RC2STA_FERR_POSITION                               0x2
#define _RC2STA_FERR_SIZE                                   0x1
#define _RC2STA_FERR_LENGTH                                 0x1
#define _RC2STA_FERR_MASK                                   0x4
#define _RC2STA_ADDEN_POSN                                  0x3
#define _RC2STA_ADDEN_POSITION                              0x3
#define _RC2STA_ADDEN_SIZE                                  0x1
#define _RC2STA_ADDEN_LENGTH                                0x1
#define _RC2STA_ADDEN_MASK                                  0x8
#define _RC2STA_CREN_POSN                                   0x4
#define _RC2STA_CREN_POSITION                               0x4
#define _RC2STA_CREN_SIZE                                   0x1
#define _RC2STA_CREN_LENGTH                                 0x1
#define _RC2STA_CREN_MASK                                   0x10
#define _RC2STA_SREN_POSN                                   0x5
#define _RC2STA_SREN_POSITION                               0x5
#define _RC2STA_SREN_SIZE                                   0x1
#define _RC2STA_SREN_LENGTH                                 0x1
#define _RC2STA_SREN_MASK                                   0x20
#define _RC2STA_RX9_POSN                                    0x6
#define _RC2STA_RX9_POSITION                                0x6
#define _RC2STA_RX9_SIZE                                    0x1
#define _RC2STA_RX9_LENGTH                                  0x1
#define _RC2STA_RX9_MASK                                    0x40
#define _RC2STA_SPEN_POSN                                   0x7
#define _RC2STA_SPEN_POSITION                               0x7
#define _RC2STA_SPEN_SIZE                                   0x1
#define _RC2STA_SPEN_LENGTH                                 0x1
#define _RC2STA_SPEN_MASK                                   0x80

// Register: TX2STA
#define TX2STA TX2STA
extern volatile unsigned char           TX2STA              __at(0x496);
#ifndef _LIB_BUILD
asm("TX2STA equ 0496h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TX2STAbits_t;
