MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
extern volatile unsigned char           LCDDATA15           __at(0x7AF);
#ifndef _LIB_BUILD
asm("LCDDATA15 equ 07AFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24COM1              :1;
        unsigned SEG25COM1              :1;
        unsigned SEG26COM1              :1;
        unsigned SEG27COM1              :1;
        unsigned SEG28COM1              :1;
        unsigned SEG29COM1              :1;
        unsigned SEG30COM1              :1;
        unsigned SEG31COM1              :1;
    };
} LCDDATA15bits_t;
extern volatile LCDDATA15bits_t LCDDATA15bits __at(0x7AF);
// bitfield macros
#define _LCDDATA15_SEG24COM1_POSN                           0x0
#define _LCDDATA15_SEG24COM1_POSITION                       0x0
#define _LCDDATA15_SEG24COM1_SIZE                           0x1
#define _LCDDATA15_SEG24COM1_LENGTH                         0x1
#define _LCDDATA15_SEG24COM1_MASK                           0x1
#define _LCDDATA15_SEG25COM1_POSN                           0x1
#define _LCDDATA15_SEG25COM1_POSITION                       0x1
#define _LCDDATA15_SEG25COM1_SIZE                           0x1
#define _LCDDATA15_SEG25COM1_LENGTH                         0x1
#define _LCDDATA15_SEG25COM1_MASK                           0x2
#define _LCDDATA15_SEG26COM1_POSN                           0x2
#define _LCDDATA15_SEG26COM1_POSITION                       0x2
#define _LCDDATA15_SEG26COM1_SIZE                           0x1
#define _LCDDATA15_SEG26COM1_LENGTH                         0x1
#define _LCDDATA15_SEG26COM1_MASK                           0x4
#define _LCDDATA15_SEG27COM1_POSN                           0x3
#define _LCDDATA15_SEG27COM1_POSITION                       0x3
#define _LCDDATA15_SEG27COM1_SIZE                           0x1
#define _LCDDATA15_SEG27COM1_LENGTH                         0x1
#define _LCDDATA15_SEG27COM1_MASK                           0x8
#define _LCDDATA15_SEG28COM1_POSN                           0x4
#define _LCDDATA15_SEG28COM1_POSITION                       0x4
#define _LCDDATA15_SEG28COM1_SIZE                           0x1
#define _LCDDATA15_SEG28COM1_LENGTH                         0x1
#define _LCDDATA15_SEG28COM1_MASK                           0x10
#define _LCDDATA15_SEG29COM1_POSN                           0x5
#define _LCDDATA15_SEG29COM1_POSITION                       0x5
#define _LCDDATA15_SEG29COM1_SIZE                           0x1
#define _LCDDATA15_SEG29COM1_LENGTH                         0x1
#define _LCDDATA15_SEG29COM1_MASK                           0x20
#define _LCDDATA15_SEG30COM1_POSN                           0x6
#define _LCDDATA15_SEG30COM1_POSITION                       0x6
#define _LCDDATA15_SEG30COM1_SIZE                           0x1
#define _LCDDATA15_SEG30COM1_LENGTH                         0x1
#define _LCDDATA15_SEG30COM1_MASK                           0x40
#define _LCDDATA15_SEG31COM1_POSN                           0x7
#define _LCDDATA15_SEG31COM1_POSITION                       0x7
#define _LCDDATA15_SEG31COM1_SIZE                           0x1
#define _LCDDATA15_SEG31COM1_LENGTH                         0x1
#define _LCDDATA15_SEG31COM1_MASK                           0x80

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
extern volatile unsigned char           LCDDATA16           __at(0x7B0);
#ifndef _LIB_BUILD
asm("LCDDATA16 equ 07B0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32COM1              :1;
        unsigned SEG33COM1              :1;
        unsigned SEG34COM1              :1;
        unsigned SEG35COM1              :1;
        unsigned SEG36COM1              :1;
        unsigned SEG37COM1              :1;
        unsigned SEG38COM1              :1;
        unsigned SEG39COM1              :1;
    };
} LCDDATA16bits_t;
extern volatile LCDDATA16bits_t LCDDATA16bits __at(0x7B0);
// bitfield macros
#define _LCDDATA16_SEG32COM1_POSN                           0x0
#define _LCDDATA16_SEG32COM1_POSITION                       0x0
#define _LCDDATA16_SEG32COM1_SIZE                           0x1
#define _LCDDATA16_SEG32COM1_LENGTH                         0x1
#define _LCDDATA16_SEG32COM1_MASK                           0x1
#define _LCDDATA16_SEG33COM1_POSN                           0x1
#define _LCDDATA16_SEG33COM1_POSITION                       0x1
#define _LCDDATA16_SEG33COM1_SIZE                           0x1
#define _LCDDATA16_SEG33COM1_LENGTH                         0x1
#define _LCDDATA16_SEG33COM1_MASK                           0x2
#define _LCDDATA16_SEG34COM1_POSN                           0x2
#define _LCDDATA16_SEG34COM1_POSITION                       0x2
#define _LCDDATA16_SEG34COM1_SIZE                           0x1
#define _LCDDATA16_SEG34COM1_LENGTH                         0x1
#define _LCDDATA16_SEG34COM1_MASK                           0x4
#define _LCDDATA16_SEG35COM1_POSN                           0x3
#define _LCDDATA16_SEG35COM1_POSITION                       0x3
#define _LCDDATA16_SEG35COM1_SIZE                           0x1
#define _LCDDATA16_SEG35COM1_LENGTH                         0x1
#define _LCDDATA16_SEG35COM1_MASK                           0x8
#define _LCDDATA16_SEG36COM1_POSN                           0x4
#define _LCDDATA16_SEG36COM1_POSITION                       0x4
#define _LCDDATA16_SEG36COM1_SIZE                           0x1
#define _LCDDATA16_SEG36COM1_LENGTH                         0x1
#define _LCDDATA16_SEG36COM1_MASK                           0x10
#define _LCDDATA16_SEG37COM1_POSN                           0x5
#define _LCDDATA16_SEG37COM1_POSITION                       0x5
#define _LCDDATA16_SEG37COM1_SIZE                           0x1
#define _LCDDATA16_SEG37COM1_LENGTH                         0x1
#define _LCDDATA16_SEG37COM1_MASK                           0x20
#define _LCDDATA16_SEG38COM1_POSN                           0x6
#define _LCDDATA16_SEG38COM1_POSITION                       0x6
#define _LCDDATA16_SEG38COM1_SIZE                           0x1
#define _LCDDATA16_SEG38COM1_LENGTH                         0x1
#define _LCDDATA16_SEG38COM1_MASK                           0x40
#define _LCDDATA16_SEG39COM1_POSN                           0x7
#define _LCDDATA16_SEG39COM1_POSITION                       0x7
#define _LCDDATA16_SEG39COM1_SIZE                           0x1
#define _LCDDATA16_SEG39COM1_LENGTH                         0x1
#define _LCDDATA16_SEG39COM1_MASK                           0x80

