MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
// Register: LCDDATA17
#define LCDDATA17 LCDDATA17
extern volatile unsigned char           LCDDATA17           __at(0x7B1);
#ifndef _LIB_BUILD
asm("LCDDATA17 equ 07B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG40COM1              :1;
        unsigned SEG41COM1              :1;
        unsigned SEG42COM1              :1;
        unsigned SEG43COM1              :1;
        unsigned SEG44COM1              :1;
        unsigned SEG45COM1              :1;
    };
} LCDDATA17bits_t;
extern volatile LCDDATA17bits_t LCDDATA17bits __at(0x7B1);
// bitfield macros
#define _LCDDATA17_SEG40COM1_POSN                           0x0
#define _LCDDATA17_SEG40COM1_POSITION                       0x0
#define _LCDDATA17_SEG40COM1_SIZE                           0x1
#define _LCDDATA17_SEG40COM1_LENGTH                         0x1
#define _LCDDATA17_SEG40COM1_MASK                           0x1
#define _LCDDATA17_SEG41COM1_POSN                           0x1
#define _LCDDATA17_SEG41COM1_POSITION                       0x1
#define _LCDDATA17_SEG41COM1_SIZE                           0x1
#define _LCDDATA17_SEG41COM1_LENGTH                         0x1
#define _LCDDATA17_SEG41COM1_MASK                           0x2
#define _LCDDATA17_SEG42COM1_POSN                           0x2
#define _LCDDATA17_SEG42COM1_POSITION                       0x2
#define _LCDDATA17_SEG42COM1_SIZE                           0x1
#define _LCDDATA17_SEG42COM1_LENGTH                         0x1
#define _LCDDATA17_SEG42COM1_MASK                           0x4
#define _LCDDATA17_SEG43COM1_POSN                           0x3
#define _LCDDATA17_SEG43COM1_POSITION                       0x3
#define _LCDDATA17_SEG43COM1_SIZE                           0x1
#define _LCDDATA17_SEG43COM1_LENGTH                         0x1
#define _LCDDATA17_SEG43COM1_MASK                           0x8
#define _LCDDATA17_SEG44COM1_POSN                           0x4
#define _LCDDATA17_SEG44COM1_POSITION                       0x4
#define _LCDDATA17_SEG44COM1_SIZE                           0x1
#define _LCDDATA17_SEG44COM1_LENGTH                         0x1
#define _LCDDATA17_SEG44COM1_MASK                           0x10
#define _LCDDATA17_SEG45COM1_POSN                           0x5
#define _LCDDATA17_SEG45COM1_POSITION                       0x5
#define _LCDDATA17_SEG45COM1_SIZE                           0x1
#define _LCDDATA17_SEG45COM1_LENGTH                         0x1
#define _LCDDATA17_SEG45COM1_MASK                           0x20

// Register: LCDDATA18
#define LCDDATA18 LCDDATA18
extern volatile unsigned char           LCDDATA18           __at(0x7B2);
#ifndef _LIB_BUILD
asm("LCDDATA18 equ 07B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG24COM2              :1;
        unsigned SEG25COM2              :1;
        unsigned SEG26COM2              :1;
        unsigned SEG27COM2              :1;
        unsigned SEG28COM2              :1;
        unsigned SEG29COM2              :1;
        unsigned SEG30COM2              :1;
        unsigned SEG31COM2              :1;
    };
} LCDDATA18bits_t;
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0x7B2);
// bitfield macros
#define _LCDDATA18_SEG24COM2_POSN                           0x0
#define _LCDDATA18_SEG24COM2_POSITION                       0x0
#define _LCDDATA18_SEG24COM2_SIZE                           0x1
#define _LCDDATA18_SEG24COM2_LENGTH                         0x1
#define _LCDDATA18_SEG24COM2_MASK                           0x1
#define _LCDDATA18_SEG25COM2_POSN                           0x1
#define _LCDDATA18_SEG25COM2_POSITION                       0x1
#define _LCDDATA18_SEG25COM2_SIZE                           0x1
#define _LCDDATA18_SEG25COM2_LENGTH                         0x1
#define _LCDDATA18_SEG25COM2_MASK                           0x2
#define _LCDDATA18_SEG26COM2_POSN                           0x2
#define _LCDDATA18_SEG26COM2_POSITION                       0x2
#define _LCDDATA18_SEG26COM2_SIZE                           0x1
#define _LCDDATA18_SEG26COM2_LENGTH                         0x1
#define _LCDDATA18_SEG26COM2_MASK                           0x4
#define _LCDDATA18_SEG27COM2_POSN                           0x3
#define _LCDDATA18_SEG27COM2_POSITION                       0x3
#define _LCDDATA18_SEG27COM2_SIZE                           0x1
#define _LCDDATA18_SEG27COM2_LENGTH                         0x1
#define _LCDDATA18_SEG27COM2_MASK                           0x8
#define _LCDDATA18_SEG28COM2_POSN                           0x4
#define _LCDDATA18_SEG28COM2_POSITION                       0x4
#define _LCDDATA18_SEG28COM2_SIZE                           0x1
#define _LCDDATA18_SEG28COM2_LENGTH                         0x1
#define _LCDDATA18_SEG28COM2_MASK                           0x10
#define _LCDDATA18_SEG29COM2_POSN                           0x5
#define _LCDDATA18_SEG29COM2_POSITION                       0x5
#define _LCDDATA18_SEG29COM2_SIZE                           0x1
#define _LCDDATA18_SEG29COM2_LENGTH                         0x1
#define _LCDDATA18_SEG29COM2_MASK                           0x20
#define _LCDDATA18_SEG30COM2_POSN                           0x6
#define _LCDDATA18_SEG30COM2_POSITION                       0x6
#define _LCDDATA18_SEG30COM2_SIZE                           0x1
#define _LCDDATA18_SEG30COM2_LENGTH                         0x1
#define _LCDDATA18_SEG30COM2_MASK                           0x40
#define _LCDDATA18_SEG31COM2_POSN                           0x7
#define _LCDDATA18_SEG31COM2_POSITION                       0x7
#define _LCDDATA18_SEG31COM2_SIZE                           0x1
#define _LCDDATA18_SEG31COM2_LENGTH                         0x1
#define _LCDDATA18_SEG31COM2_MASK                           0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0x7B3);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 07B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG32COM2              :1;
        unsigned SEG33COM2              :1;
        unsigned SEG34COM2              :1;
        unsigned SEG35COM2              :1;
        unsigned SEG36COM2              :1;
        unsigned SEG37COM2              :1;
        unsigned SEG38COM2              :1;
        unsigned SEG39COM2              :1;
    };
} LCDDATA19bits_t;
extern volatile LCDDATA19bits_t LCDDATA19bits __at(0x7B3);
// bitfield macros
#define _LCDDATA19_SEG32COM2_POSN                           0x0
#define _LCDDATA19_SEG32COM2_POSITION                       0x0
#define _LCDDATA19_SEG32COM2_SIZE                           0x1
#define _LCDDATA19_SEG32COM2_LENGTH                         0x1
#define _LCDDATA19_SEG32COM2_MASK                           0x1
#define _LCDDATA19_SEG33COM2_POSN                           0x1
#define _LCDDATA19_SEG33COM2_POSITION                       0x1
#define _LCDDATA19_SEG33COM2_SIZE                           0x1
#define _LCDDATA19_SEG33COM2_LENGTH                         0x1
#define _LCDDATA19_SEG33COM2_MASK                           0x2
#define _LCDDATA19_SEG34COM2_POSN                           0x2
#define _LCDDATA19_SEG34COM2_POSITION                       0x2
#define _LCDDATA19_SEG34COM2_SIZE                           0x1
#define _LCDDATA19_SEG34COM2_LENGTH                         0x1
#define _LCDDATA19_SEG34COM2_MASK                           0x4
#define _LCDDATA19_SEG35COM2_POSN                           0x3
#define _LCDDATA19_SEG35COM2_POSITION                       0x3
#define _LCDDATA19_SEG35COM2_SIZE                           0x1
#define _LCDDATA19_SEG35COM2_LENGTH                         0x1
#define _LCDDATA19_SEG35COM2_MASK                           0x8
#define _LCDDATA19_SEG36COM2_POSN                           0x4
#define _LCDDATA19_SEG36COM2_POSITION                       0x4
#define _LCDDATA19_SEG36COM2_SIZE                           0x1
#define _LCDDATA19_SEG36COM2_LENGTH                         0x1
#define _LCDDATA19_SEG36COM2_MASK                           0x10
#define _LCDDATA19_SEG37COM2_POSN                           0x5
#define _LCDDATA19_SEG37COM2_POSITION                       0x5
#define _LCDDATA19_SEG37COM2_SIZE                           0x1
#define _LCDDATA19_SEG37COM2_LENGTH                         0x1
#define _LCDDATA19_SEG37COM2_MASK                           0x20
#define _LCDDATA19_SEG38COM2_POSN                           0x6
#define _LCDDATA19_SEG38COM2_POSITION                       0x6
#define _LCDDATA19_SEG38COM2_SIZE                           0x1
#define _LCDDATA19_SEG38COM2_LENGTH                         0x1
#define _LCDDATA19_SEG38COM2_MASK                           0x40
#define _LCDDATA19_SEG39COM2_POSN                           0x7
#define _LCDDATA19_SEG39COM2_POSITION                       0x7
#define _LCDDATA19_SEG39COM2_SIZE                           0x1
#define _LCDDATA19_SEG39COM2_LENGTH                         0x1
#define _LCDDATA19_SEG39COM2_MASK                           0x80

