MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
extern volatile __bit                   C3TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,5)
// CCPTMRS0<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x14F6);	// @ (0x29E * 8 + 6)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x14F7);	// @ (0x29E * 8 + 7)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C5TSEL1>
extern volatile __bit                   C5TSEL1             __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 C5TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x72);	// @ (0xE * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// CCP1AS<CCP1AS0>
extern volatile __bit                   CCP1AS0             __at(0x14AC);	// @ (0x295 * 8 + 4)
#define                                 CCP1AS0_bit         _BIT_ACCESS(CCP1AS,4)
// CCP1AS<CCP1AS1>
extern volatile __bit                   CCP1AS1             __at(0x14AD);	// @ (0x295 * 8 + 5)
#define                                 CCP1AS1_bit         _BIT_ACCESS(CCP1AS,5)
// CCP1AS<CCP1AS2>
extern volatile __bit                   CCP1AS2             __at(0x14AE);	// @ (0x295 * 8 + 6)
#define                                 CCP1AS2_bit         _BIT_ACCESS(CCP1AS,6)
// CCP1AS<CCP1ASE>
extern volatile __bit                   CCP1ASE             __at(0x14AF);	// @ (0x295 * 8 + 7)
#define                                 CCP1ASE_bit         _BIT_ACCESS(CCP1AS,7)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x8A);	// @ (0x11 * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x1498);	// @ (0x293 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x1499);	// @ (0x293 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x149A);	// @ (0x293 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x149B);	// @ (0x293 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP2AS<CCP2AS0>
extern volatile __bit                   CCP2AS0             __at(0x14E4);	// @ (0x29C * 8 + 4)
#define                                 CCP2AS0_bit         _BIT_ACCESS(CCP2AS,4)
// CCP2AS<CCP2AS1>
extern volatile __bit                   CCP2AS1             __at(0x14E5);	// @ (0x29C * 8 + 5)
#define                                 CCP2AS1_bit         _BIT_ACCESS(CCP2AS,5)
// CCP2AS<CCP2AS2>
extern volatile __bit                   CCP2AS2             __at(0x14E6);	// @ (0x29C * 8 + 6)
#define                                 CCP2AS2_bit         _BIT_ACCESS(CCP2AS,6)
// CCP2AS<CCP2ASE>
extern volatile __bit                   CCP2ASE             __at(0x14E7);	// @ (0x29C * 8 + 7)
#define                                 CCP2ASE_bit         _BIT_ACCESS(CCP2AS,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x90);	// @ (0x12 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x14D0);	// @ (0x29A * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x14D1);	// @ (0x29A * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x14D2);	// @ (0x29A * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// APFCON<CCP2SEL>
extern volatile __bit                   CCP2SEL             __at(0x8EA);	// @ (0x11D * 8 + 2)
#define                                 CCP2SEL_bit         _BIT_ACCESS(APFCON,2)
// PORTG<CCP3>
extern volatile __bit                   CCP3                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// CCP3AS<CCP3AS0>
extern volatile __bit                   CCP3AS0             __at(0x18AC);	// @ (0x315 * 8 + 4)
#define                                 CCP3AS0_bit         _BIT_ACCESS(CCP3AS,4)
// CCP3AS<CCP3AS1>
extern volatile __bit                   CCP3AS1             __at(0x18AD);	// @ (0x315 * 8 + 5)
#define                                 CCP3AS1_bit         _BIT_ACCESS(CCP3AS,5)
// CCP3AS<CCP3AS2>
extern volatile __bit                   CCP3AS2             __at(0x18AE);	// @ (0x315 * 8 + 6)
#define                                 CCP3AS2_bit         _BIT_ACCESS(CCP3AS,6)
// CCP3AS<CCP3ASE>
extern volatile __bit                   CCP3ASE             __at(0x18AF);	// @ (0x315 * 8 + 7)
#define                                 CCP3ASE_bit         _BIT_ACCESS(CCP3AS,7)
// PIE3<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x49C);	// @ (0x93 * 8 + 4)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x9C);	// @ (0x13 * 8 + 4)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR3,4)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x1898);	// @ (0x313 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x1899);	// @ (0x313 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x189A);	// @ (0x313 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x189B);	// @ (0x313 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// PORTG<CCP4>
extern volatile __bit                   CCP4                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 CCP4_bit            _BIT_ACCESS(PORTG,3)
// PIE3<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE3,5)
// PIR3<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR3,5)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x18D0);	// @ (0x31A * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x18D1);	// @ (0x31A * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x18D2);	// @ (0x31A * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
extern volatile __bit                   CCP4M3              __at(0x18D3);	// @ (0x31A * 8 + 3)
#define                                 CCP4M3_bit          _BIT_ACCESS(CCP4CON,3)
// PORTG<CCP5>
extern volatile __bit                   CCP5                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 CCP5_bit            _BIT_ACCESS(PORTG,4)
// PIE3<CCP5IE>
extern volatile __bit                   CCP5IE              __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 CCP5IE_bit          _BIT_ACCESS(PIE3,6)
// PIR3<CCP5IF>
extern volatile __bit                   CCP5IF              __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 CCP5IF_bit          _BIT_ACCESS(PIR3,6)
// CCP5CON<CCP5M0>
extern volatile __bit                   CCP5M0              __at(0x18F0);	// @ (0x31E * 8 + 0)
#define                                 CCP5M0_bit          _BIT_ACCESS(CCP5CON,0)
// CCP5CON<CCP5M1>
extern volatile __bit                   CCP5M1              __at(0x18F1);	// @ (0x31E * 8 + 1)
#define                                 CCP5M1_bit          _BIT_ACCESS(CCP5CON,1)
// CCP5CON<CCP5M2>
extern volatile __bit                   CCP5M2              __at(0x18F2);	// @ (0x31E * 8 + 2)
#define                                 CCP5M2_bit          _BIT_ACCESS(CCP5CON,2)
// CCP5CON<CCP5M3>
extern volatile __bit                   CCP5M3              __at(0x18F3);	// @ (0x31E * 8 + 3)
#define                                 CCP5M3_bit          _BIT_ACCESS(CCP5CON,3)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x8BA);	// @ (0x117 * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x8BB);	// @ (0x117 * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON0<CHS4>
extern volatile __bit                   CHS4                __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 CHS4_bit            _BIT_ACCESS(ADCON0,6)
// PORTC<CK1>
extern volatile __bit                   CK1                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 CK1_bit             _BIT_ACCESS(PORTC,6)
// PORTG<CK2>
extern volatile __bit                   CK2                 __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 CK2_bit             _BIT_ACCESS(PORTG,1)
// PORTA<CLKIN>
extern volatile __bit                   CLKIN               __at(0x67);	// @ (0xC * 8 + 7)
#define                                 CLKIN_bit           _BIT_ACCESS(PORTA,7)
// PORTA<CLKOUT>
extern volatile __bit                   CLKOUT              __at(0x66);	// @ (0xC * 8 + 6)
#define                                 CLKOUT_bit          _BIT_ACCESS(PORTA,6)
// PORTE<COM0>
extern volatile __bit                   COM0                __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 COM0_bit            _BIT_ACCESS(PORTE,3)
// PORTE<COM1>
extern volatile __bit                   COM1                __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 COM1_bit            _BIT_ACCESS(PORTE,4)
// PORTE<COM2>
extern volatile __bit                   COM2                __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 COM2_bit            _BIT_ACCESS(PORTE,5)
// PORTE<COM3>
extern volatile __bit                   COM3                __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 COM3_bit            _BIT_ACCESS(PORTE,6)
// PORTA<CPS0>
extern volatile __bit                   CPS0                __at(0x60);	// @ (0xC * 8 + 0)
#define                                 CPS0_bit            _BIT_ACCESS(PORTA,0)
// PORTA<CPS1>
extern volatile __bit                   CPS1                __at(0x61);	// @ (0xC * 8 + 1)
#define                                 CPS1_bit            _BIT_ACCESS(PORTA,1)
// PORTF<CPS10>
extern volatile __bit                   CPS10               __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 CPS10_bit           _BIT_ACCESS(PORTF,5)
// PORTF<CPS11>
extern volatile __bit                   CPS11               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 CPS11_bit           _BIT_ACCESS(PORTF,6)
// PORTG<CPS12>
extern volatile __bit                   CPS12               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 CPS12_bit           _BIT_ACCESS(PORTG,4)
// PORTG<CPS13>
extern volatile __bit                   CPS13               __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 CPS13_bit           _BIT_ACCESS(PORTG,3)
// PORTG<CPS14>
extern volatile __bit                   CPS14               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 CPS14_bit           _BIT_ACCESS(PORTG,2)
// PORTG<CPS15>
extern volatile __bit                   CPS15               __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 CPS15_bit           _BIT_ACCESS(PORTG,1)
// PORTF<CPS16>
extern volatile __bit                   CPS16               __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 CPS16_bit           _BIT_ACCESS(PORTF,0)
// PORTA<CPS2>
extern volatile __bit                   CPS2                __at(0x62);	// @ (0xC * 8 + 2)
#define                                 CPS2_bit            _BIT_ACCESS(PORTA,2)
// PORTA<CPS3>
extern volatile __bit                   CPS3                __at(0x63);	// @ (0xC * 8 + 3)
#define                                 CPS3_bit            _BIT_ACCESS(PORTA,3)
// PORTA<CPS4>
extern volatile __bit                   CPS4                __at(0x65);	// @ (0xC * 8 + 5)
#define                                 CPS4_bit            _BIT_ACCESS(PORTA,5)
// PORTF<CPS5>
extern volatile __bit                   CPS5                __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 CPS5_bit            _BIT_ACCESS(PORTF,7)
// PORTF<CPS6>
extern volatile __bit                   CPS6                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 CPS6_bit            _BIT_ACCESS(PORTF,1)
// PORTF<CPS7>
extern volatile __bit                   CPS7                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 CPS7_bit            _BIT_ACCESS(PORTF,2)
// PORTF<CPS8>
extern volatile __bit                   CPS8                __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 CPS8_bit            _BIT_ACCESS(PORTF,3)
// PORTF<CPS9>
extern volatile __bit                   CPS9                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 CPS9_bit            _BIT_ACCESS(PORTF,4)
// CPSCON1<CPSCH0>
extern volatile __bit                   CPSCH0              __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 CPSCH0_bit          _BIT_ACCESS(CPSCON1,0)
// CPSCON1<CPSCH1>
extern volatile __bit                   CPSCH1              __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 CPSCH1_bit          _BIT_ACCESS(CPSCON1,1)
// CPSCON1<CPSCH2>
extern volatile __bit                   CPSCH2              __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 CPSCH2_bit          _BIT_ACCESS(CPSCON1,2)
// CPSCON1<CPSCH3>
extern volatile __bit                   CPSCH3              __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CPSCH3_bit          _BIT_ACCESS(CPSCON1,3)
// CPSCON1<CPSCH4>
extern volatile __bit                   CPSCH4              __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CPSCH4_bit          _BIT_ACCESS(CPSCON1,4)
// CPSCON0<CPSON>
extern volatile __bit                   CPSON               __at(0xF7);	// @ (0x1E * 8 + 7)
#define                                 CPSON_bit           _BIT_ACCESS(CPSCON0,7)
// CPSCON0<CPSOUT>
extern volatile __bit                   CPSOUT              __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 CPSOUT_bit          _BIT_ACCESS(CPSCON0,1)
// CPSCON0<CPSRM>
extern volatile __bit                   CPSRM               __at(0xF6);	// @ (0x1E * 8 + 6)
#define                                 CPSRM_bit           _BIT_ACCESS(CPSCON0,6)
// CPSCON0<CPSRNG0>
extern volatile __bit                   CPSRNG0             __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 CPSRNG0_bit         _BIT_ACCESS(CPSCON0,2)
// CPSCON0<CPSRNG1>
extern volatile __bit                   CPSRNG1             __at(0xF3);	// @ (0x1E * 8 + 3)
#define                                 CPSRNG1_bit         _BIT_ACCESS(CPSCON0,3)
// LCDCON<CS0>
extern volatile __bit                   CS0                 __at(0x3C8A);	// @ (0x791 * 8 + 2)
#define                                 CS0_bit             _BIT_ACCESS(LCDCON,2)
// LCDCON<CS1>
extern volatile __bit                   CS1                 __at(0x3C8B);	// @ (0x791 * 8 + 3)
#define                                 CS1_bit             _BIT_ACCESS(LCDCON,3)
// STATUS_SHAD<C_SHAD>
extern volatile __bit                   C_SHAD              __at(0x7F20);	// @ (0xFE4 * 8 + 0)
#define                                 C_SHAD_bit          _BIT_ACCESS(STATUS_SHAD,0)
// DACCON0<DACEN>
extern volatile __bit                   DACEN               __at(0x8C7);	// @ (0x118 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(DACCON0,7)
// DACCON0<DACLPS>
extern volatile __bit                   DACLPS              __at(0x8C6);	// @ (0x118 * 8 + 6)
#define                                 DACLPS_bit          _BIT_ACCESS(DACCON0,6)
// DACCON0<DACNSS>
extern volatile __bit                   DACNSS              __at(0x8C0);	// @ (0x118 * 8 + 0)
#define                                 DACNSS_bit          _BIT_ACCESS(DACCON0,0)
// DACCON0<DACOE>
extern volatile __bit                   DACOE               __at(0x8C5);	// @ (0x118 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(DACCON0,5)
// PORTF<DACOUT>
extern volatile __bit                   DACOUT              __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 DACOUT_bit          _BIT_ACCESS(PORTF,5)
// DACCON0<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x8C2);	// @ (0x118 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(DACCON0,2)
// DACCON0<DACPSS1>
extern volatile __bit                   DACPSS1             __at(0x8C3);	// @ (0x118 * 8 + 3)
#define                                 DACPSS1_bit         _BIT_ACCESS(DACCON0,3)
// DACCON1<DACR0>
extern volatile __bit                   DACR0               __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(DACCON1,0)
// DACCON1<DACR1>
extern volatile __bit                   DACR1               __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(DACCON1,1)
// DACCON1<DACR2>
extern volatile __bit                   DACR2               __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(DACCON1,2)
// DACCON1<DACR3>
extern volatile __bit                   DACR3               __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(DACCON1,3)
// DACCON1<DACR4>
extern volatile __bit                   DACR4               __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(DACCON1,4)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0x149C);	// @ (0x293 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0x149D);	// @ (0x293 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// CCP2CON<DC2B0>
extern volatile __bit                   DC2B0               __at(0x14D4);	// @ (0x29A * 8 + 4)
#define                                 DC2B0_bit           _BIT_ACCESS(CCP2CON,4)
// CCP2CON<DC2B1>
extern volatile __bit                   DC2B1               __at(0x14D5);	// @ (0x29A * 8 + 5)
#define                                 DC2B1_bit           _BIT_ACCESS(CCP2CON,5)
// CCP3CON<DC3B0>
extern volatile __bit                   DC3B0               __at(0x189C);	// @ (0x313 * 8 + 4)
#define                                 DC3B0_bit           _BIT_ACCESS(CCP3CON,4)
// CCP3CON<DC3B1>
extern volatile __bit                   DC3B1               __at(0x189D);	// @ (0x313 * 8 + 5)
#define                                 DC3B1_bit           _BIT_ACCESS(CCP3CON,5)
// CCP4CON<DC4B0>
extern volatile __bit                   DC4B0               __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 DC4B0_bit           _BIT_ACCESS(CCP4CON,4)
// CCP4CON<DC4B1>
extern volatile __bit                   DC4B1               __at(0x18D5);	// @ (0x31A * 8 + 5)
#define                                 DC4B1_bit           _BIT_ACCESS(CCP4CON,5)
// CCP5CON<DC5B0>
extern volatile __bit                   DC5B0               __at(0x18F4);	// @ (0x31E * 8 + 4)
#define                                 DC5B0_bit           _BIT_ACCESS(CCP5CON,4)
// CCP5CON<DC5B1>
extern volatile __bit                   DC5B1               __at(0x18F5);	// @ (0x31E * 8 + 5)
#define                                 DC5B1_bit           _BIT_ACCESS(CCP5CON,5)
// STATUS_SHAD<DC_SHAD>
extern volatile __bit                   DC_SHAD             __at(0x7F21);	// @ (0xFE4 * 8 + 1)
#define                                 DC_SHAD_bit         _BIT_ACCESS(STATUS_SHAD,1)
// PORTC<DT1>
extern volatile __bit                   DT1                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 DT1_bit             _BIT_ACCESS(PORTC,7)
