MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
extern volatile __bit                   SEG19               __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 SEG19_bit           _BIT_ACCESS(PORTF,1)
// LCDDATA2<SEG19COM0>
extern volatile __bit                   SEG19COM0           __at(0x3D13);	// @ (0x7A2 * 8 + 3)
#define                                 SEG19COM0_bit       _BIT_ACCESS(LCDDATA2,3)
// LCDDATA5<SEG19COM1>
extern volatile __bit                   SEG19COM1           __at(0x3D2B);	// @ (0x7A5 * 8 + 3)
#define                                 SEG19COM1_bit       _BIT_ACCESS(LCDDATA5,3)
// LCDDATA8<SEG19COM2>
extern volatile __bit                   SEG19COM2           __at(0x3D43);	// @ (0x7A8 * 8 + 3)
#define                                 SEG19COM2_bit       _BIT_ACCESS(LCDDATA8,3)
// LCDDATA11<SEG19COM3>
extern volatile __bit                   SEG19COM3           __at(0x3D5B);	// @ (0x7AB * 8 + 3)
#define                                 SEG19COM3_bit       _BIT_ACCESS(LCDDATA11,3)
// LCDDATA0<SEG1COM0>
extern volatile __bit                   SEG1COM0            __at(0x3D01);	// @ (0x7A0 * 8 + 1)
#define                                 SEG1COM0_bit        _BIT_ACCESS(LCDDATA0,1)
// LCDDATA3<SEG1COM1>
extern volatile __bit                   SEG1COM1            __at(0x3D19);	// @ (0x7A3 * 8 + 1)
#define                                 SEG1COM1_bit        _BIT_ACCESS(LCDDATA3,1)
// LCDDATA6<SEG1COM2>
extern volatile __bit                   SEG1COM2            __at(0x3D31);	// @ (0x7A6 * 8 + 1)
#define                                 SEG1COM2_bit        _BIT_ACCESS(LCDDATA6,1)
// LCDDATA9<SEG1COM3>
extern volatile __bit                   SEG1COM3            __at(0x3D49);	// @ (0x7A9 * 8 + 1)
#define                                 SEG1COM3_bit        _BIT_ACCESS(LCDDATA9,1)
// PORTD<SEG2>
extern volatile __bit                   SEG2                __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 SEG2_bit            _BIT_ACCESS(PORTD,2)
// PORTF<SEG20>
extern volatile __bit                   SEG20               __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 SEG20_bit           _BIT_ACCESS(PORTF,2)
// LCDDATA2<SEG20COM0>
extern volatile __bit                   SEG20COM0           __at(0x3D14);	// @ (0x7A2 * 8 + 4)
#define                                 SEG20COM0_bit       _BIT_ACCESS(LCDDATA2,4)
// LCDDATA5<SEG20COM1>
extern volatile __bit                   SEG20COM1           __at(0x3D2C);	// @ (0x7A5 * 8 + 4)
#define                                 SEG20COM1_bit       _BIT_ACCESS(LCDDATA5,4)
// LCDDATA8<SEG20COM2>
extern volatile __bit                   SEG20COM2           __at(0x3D44);	// @ (0x7A8 * 8 + 4)
#define                                 SEG20COM2_bit       _BIT_ACCESS(LCDDATA8,4)
// LCDDATA11<SEG20COM3>
extern volatile __bit                   SEG20COM3           __at(0x3D5C);	// @ (0x7AB * 8 + 4)
#define                                 SEG20COM3_bit       _BIT_ACCESS(LCDDATA11,4)
// PORTF<SEG21>
extern volatile __bit                   SEG21               __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 SEG21_bit           _BIT_ACCESS(PORTF,3)
// LCDDATA2<SEG21COM0>
extern volatile __bit                   SEG21COM0           __at(0x3D15);	// @ (0x7A2 * 8 + 5)
#define                                 SEG21COM0_bit       _BIT_ACCESS(LCDDATA2,5)
// LCDDATA5<SEG21COM1>
extern volatile __bit                   SEG21COM1           __at(0x3D2D);	// @ (0x7A5 * 8 + 5)
#define                                 SEG21COM1_bit       _BIT_ACCESS(LCDDATA5,5)
// LCDDATA8<SEG21COM2>
extern volatile __bit                   SEG21COM2           __at(0x3D45);	// @ (0x7A8 * 8 + 5)
#define                                 SEG21COM2_bit       _BIT_ACCESS(LCDDATA8,5)
// LCDDATA11<SEG21COM3>
extern volatile __bit                   SEG21COM3           __at(0x3D5D);	// @ (0x7AB * 8 + 5)
#define                                 SEG21COM3_bit       _BIT_ACCESS(LCDDATA11,5)
// PORTF<SEG22>
extern volatile __bit                   SEG22               __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 SEG22_bit           _BIT_ACCESS(PORTF,4)
// LCDDATA2<SEG22COM0>
extern volatile __bit                   SEG22COM0           __at(0x3D16);	// @ (0x7A2 * 8 + 6)
#define                                 SEG22COM0_bit       _BIT_ACCESS(LCDDATA2,6)
// LCDDATA5<SEG22COM1>
extern volatile __bit                   SEG22COM1           __at(0x3D2E);	// @ (0x7A5 * 8 + 6)
#define                                 SEG22COM1_bit       _BIT_ACCESS(LCDDATA5,6)
// LCDDATA8<SEG22COM2>
extern volatile __bit                   SEG22COM2           __at(0x3D46);	// @ (0x7A8 * 8 + 6)
#define                                 SEG22COM2_bit       _BIT_ACCESS(LCDDATA8,6)
// LCDDATA11<SEG22COM3>
extern volatile __bit                   SEG22COM3           __at(0x3D5E);	// @ (0x7AB * 8 + 6)
#define                                 SEG22COM3_bit       _BIT_ACCESS(LCDDATA11,6)
// PORTF<SEG23>
extern volatile __bit                   SEG23               __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 SEG23_bit           _BIT_ACCESS(PORTF,5)
// LCDDATA2<SEG23COM0>
extern volatile __bit                   SEG23COM0           __at(0x3D17);	// @ (0x7A2 * 8 + 7)
#define                                 SEG23COM0_bit       _BIT_ACCESS(LCDDATA2,7)
// LCDDATA5<SEG23COM1>
extern volatile __bit                   SEG23COM1           __at(0x3D2F);	// @ (0x7A5 * 8 + 7)
#define                                 SEG23COM1_bit       _BIT_ACCESS(LCDDATA5,7)
// LCDDATA8<SEG23COM2>
extern volatile __bit                   SEG23COM2           __at(0x3D47);	// @ (0x7A8 * 8 + 7)
#define                                 SEG23COM2_bit       _BIT_ACCESS(LCDDATA8,7)
// LCDDATA11<SEG23COM3>
extern volatile __bit                   SEG23COM3           __at(0x3D5F);	// @ (0x7AB * 8 + 7)
#define                                 SEG23COM3_bit       _BIT_ACCESS(LCDDATA11,7)
// PORTF<SEG24>
extern volatile __bit                   SEG24               __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 SEG24_bit           _BIT_ACCESS(PORTF,6)
// LCDDATA12<SEG24COM0>
extern volatile __bit                   SEG24COM0           __at(0x3D60);	// @ (0x7AC * 8 + 0)
#define                                 SEG24COM0_bit       _BIT_ACCESS(LCDDATA12,0)
// LCDDATA15<SEG24COM1>
extern volatile __bit                   SEG24COM1           __at(0x3D78);	// @ (0x7AF * 8 + 0)
#define                                 SEG24COM1_bit       _BIT_ACCESS(LCDDATA15,0)
// LCDDATA18<SEG24COM2>
extern volatile __bit                   SEG24COM2           __at(0x3D90);	// @ (0x7B2 * 8 + 0)
#define                                 SEG24COM2_bit       _BIT_ACCESS(LCDDATA18,0)
// LCDDATA21<SEG24COM3>
extern volatile __bit                   SEG24COM3           __at(0x3DA8);	// @ (0x7B5 * 8 + 0)
#define                                 SEG24COM3_bit       _BIT_ACCESS(LCDDATA21,0)
// PORTF<SEG25>
extern volatile __bit                   SEG25               __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 SEG25_bit           _BIT_ACCESS(PORTF,7)
// LCDDATA12<SEG25COM0>
extern volatile __bit                   SEG25COM0           __at(0x3D61);	// @ (0x7AC * 8 + 1)
#define                                 SEG25COM0_bit       _BIT_ACCESS(LCDDATA12,1)
// LCDDATA15<SEG25COM1>
extern volatile __bit                   SEG25COM1           __at(0x3D79);	// @ (0x7AF * 8 + 1)
#define                                 SEG25COM1_bit       _BIT_ACCESS(LCDDATA15,1)
// LCDDATA18<SEG25COM2>
extern volatile __bit                   SEG25COM2           __at(0x3D91);	// @ (0x7B2 * 8 + 1)
#define                                 SEG25COM2_bit       _BIT_ACCESS(LCDDATA18,1)
// LCDDATA21<SEG25COM3>
extern volatile __bit                   SEG25COM3           __at(0x3DA9);	// @ (0x7B5 * 8 + 1)
#define                                 SEG25COM3_bit       _BIT_ACCESS(LCDDATA21,1)
// PORTG<SEG26>
extern volatile __bit                   SEG26               __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 SEG26_bit           _BIT_ACCESS(PORTG,4)
// LCDDATA12<SEG26COM0>
extern volatile __bit                   SEG26COM0           __at(0x3D62);	// @ (0x7AC * 8 + 2)
#define                                 SEG26COM0_bit       _BIT_ACCESS(LCDDATA12,2)
// LCDDATA15<SEG26COM1>
extern volatile __bit                   SEG26COM1           __at(0x3D7A);	// @ (0x7AF * 8 + 2)
#define                                 SEG26COM1_bit       _BIT_ACCESS(LCDDATA15,2)
// LCDDATA18<SEG26COM2>
extern volatile __bit                   SEG26COM2           __at(0x3D92);	// @ (0x7B2 * 8 + 2)
#define                                 SEG26COM2_bit       _BIT_ACCESS(LCDDATA18,2)
// LCDDATA21<SEG26COM3>
extern volatile __bit                   SEG26COM3           __at(0x3DAA);	// @ (0x7B5 * 8 + 2)
#define                                 SEG26COM3_bit       _BIT_ACCESS(LCDDATA21,2)
// PORTC<SEG27>
extern volatile __bit                   SEG27               __at(0x76);	// @ (0xE * 8 + 6)
#define                                 SEG27_bit           _BIT_ACCESS(PORTC,6)
// LCDDATA12<SEG27COM0>
extern volatile __bit                   SEG27COM0           __at(0x3D63);	// @ (0x7AC * 8 + 3)
#define                                 SEG27COM0_bit       _BIT_ACCESS(LCDDATA12,3)
// LCDDATA15<SEG27COM1>
extern volatile __bit                   SEG27COM1           __at(0x3D7B);	// @ (0x7AF * 8 + 3)
#define                                 SEG27COM1_bit       _BIT_ACCESS(LCDDATA15,3)
// LCDDATA18<SEG27COM2>
extern volatile __bit                   SEG27COM2           __at(0x3D93);	// @ (0x7B2 * 8 + 3)
#define                                 SEG27COM2_bit       _BIT_ACCESS(LCDDATA18,3)
// LCDDATA21<SEG27COM3>
extern volatile __bit                   SEG27COM3           __at(0x3DAB);	// @ (0x7B5 * 8 + 3)
#define                                 SEG27COM3_bit       _BIT_ACCESS(LCDDATA21,3)
// PORTC<SEG28>
extern volatile __bit                   SEG28               __at(0x77);	// @ (0xE * 8 + 7)
#define                                 SEG28_bit           _BIT_ACCESS(PORTC,7)
// LCDDATA12<SEG28COM0>
extern volatile __bit                   SEG28COM0           __at(0x3D64);	// @ (0x7AC * 8 + 4)
#define                                 SEG28COM0_bit       _BIT_ACCESS(LCDDATA12,4)
// LCDDATA15<SEG28COM1>
extern volatile __bit                   SEG28COM1           __at(0x3D7C);	// @ (0x7AF * 8 + 4)
#define                                 SEG28COM1_bit       _BIT_ACCESS(LCDDATA15,4)
// LCDDATA18<SEG28COM2>
extern volatile __bit                   SEG28COM2           __at(0x3D94);	// @ (0x7B2 * 8 + 4)
#define                                 SEG28COM2_bit       _BIT_ACCESS(LCDDATA18,4)
// LCDDATA21<SEG28COM3>
extern volatile __bit                   SEG28COM3           __at(0x3DAC);	// @ (0x7B5 * 8 + 4)
#define                                 SEG28COM3_bit       _BIT_ACCESS(LCDDATA21,4)
// PORTB<SEG29>
extern volatile __bit                   SEG29               __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 SEG29_bit           _BIT_ACCESS(PORTB,5)
// LCDDATA12<SEG29COM0>
extern volatile __bit                   SEG29COM0           __at(0x3D65);	// @ (0x7AC * 8 + 5)
#define                                 SEG29COM0_bit       _BIT_ACCESS(LCDDATA12,5)
// LCDDATA15<SEG29COM1>
extern volatile __bit                   SEG29COM1           __at(0x3D7D);	// @ (0x7AF * 8 + 5)
#define                                 SEG29COM1_bit       _BIT_ACCESS(LCDDATA15,5)
// LCDDATA18<SEG29COM2>
extern volatile __bit                   SEG29COM2           __at(0x3D95);	// @ (0x7B2 * 8 + 5)
#define                                 SEG29COM2_bit       _BIT_ACCESS(LCDDATA18,5)
// LCDDATA21<SEG29COM3>
extern volatile __bit                   SEG29COM3           __at(0x3DAD);	// @ (0x7B5 * 8 + 5)
#define                                 SEG29COM3_bit       _BIT_ACCESS(LCDDATA21,5)
// LCDDATA0<SEG2COM0>
extern volatile __bit                   SEG2COM0            __at(0x3D02);	// @ (0x7A0 * 8 + 2)
#define                                 SEG2COM0_bit        _BIT_ACCESS(LCDDATA0,2)
// LCDDATA3<SEG2COM1>
extern volatile __bit                   SEG2COM1            __at(0x3D1A);	// @ (0x7A3 * 8 + 2)
#define                                 SEG2COM1_bit        _BIT_ACCESS(LCDDATA3,2)
// LCDDATA6<SEG2COM2>
extern volatile __bit                   SEG2COM2            __at(0x3D32);	// @ (0x7A6 * 8 + 2)
#define                                 SEG2COM2_bit        _BIT_ACCESS(LCDDATA6,2)
// LCDDATA9<SEG2COM3>
extern volatile __bit                   SEG2COM3            __at(0x3D4A);	// @ (0x7A9 * 8 + 2)
#define                                 SEG2COM3_bit        _BIT_ACCESS(LCDDATA9,2)
// PORTD<SEG3>
extern volatile __bit                   SEG3                __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 SEG3_bit            _BIT_ACCESS(PORTD,3)
// PORTB<SEG30>
extern volatile __bit                   SEG30               __at(0x68);	// @ (0xD * 8 + 0)
#define                                 SEG30_bit           _BIT_ACCESS(PORTB,0)
// LCDDATA12<SEG30COM0>
extern volatile __bit                   SEG30COM0           __at(0x3D66);	// @ (0x7AC * 8 + 6)
#define                                 SEG30COM0_bit       _BIT_ACCESS(LCDDATA12,6)
// LCDDATA15<SEG30COM1>
extern volatile __bit                   SEG30COM1           __at(0x3D7E);	// @ (0x7AF * 8 + 6)
#define                                 SEG30COM1_bit       _BIT_ACCESS(LCDDATA15,6)
// LCDDATA18<SEG30COM2>
extern volatile __bit                   SEG30COM2           __at(0x3D96);	// @ (0x7B2 * 8 + 6)
#define                                 SEG30COM2_bit       _BIT_ACCESS(LCDDATA18,6)
// LCDDATA21<SEG30COM3>
extern volatile __bit                   SEG30COM3           __at(0x3DAE);	// @ (0x7B5 * 8 + 6)
#define                                 SEG30COM3_bit       _BIT_ACCESS(LCDDATA21,6)
// PORTE<SEG31>
extern volatile __bit                   SEG31               __at(0x87);	// @ (0x10 * 8 + 7)
#define                                 SEG31_bit           _BIT_ACCESS(PORTE,7)
// LCDDATA12<SEG31COM0>
extern volatile __bit                   SEG31COM0           __at(0x3D67);	// @ (0x7AC * 8 + 7)
#define                                 SEG31COM0_bit       _BIT_ACCESS(LCDDATA12,7)
// LCDDATA15<SEG31COM1>
extern volatile __bit                   SEG31COM1           __at(0x3D7F);	// @ (0x7AF * 8 + 7)
#define                                 SEG31COM1_bit       _BIT_ACCESS(LCDDATA15,7)
// LCDDATA18<SEG31COM2>
extern volatile __bit                   SEG31COM2           __at(0x3D97);	// @ (0x7B2 * 8 + 7)
#define                                 SEG31COM2_bit       _BIT_ACCESS(LCDDATA18,7)
// LCDDATA21<SEG31COM3>
extern volatile __bit                   SEG31COM3           __at(0x3DAF);	// @ (0x7B5 * 8 + 7)
#define                                 SEG31COM3_bit       _BIT_ACCESS(LCDDATA21,7)
// PORTC<SEG32>
extern volatile __bit                   SEG32               __at(0x71);	// @ (0xE * 8 + 1)
#define                                 SEG32_bit           _BIT_ACCESS(PORTC,1)
// LCDDATA13<SEG32COM0>
extern volatile __bit                   SEG32COM0           __at(0x3D68);	// @ (0x7AD * 8 + 0)
#define                                 SEG32COM0_bit       _BIT_ACCESS(LCDDATA13,0)
// LCDDATA16<SEG32COM1>
extern volatile __bit                   SEG32COM1           __at(0x3D80);	// @ (0x7B0 * 8 + 0)
#define                                 SEG32COM1_bit       _BIT_ACCESS(LCDDATA16,0)
// LCDDATA19<SEG32COM2>
extern volatile __bit                   SEG32COM2           __at(0x3D98);	// @ (0x7B3 * 8 + 0)
#define                                 SEG32COM2_bit       _BIT_ACCESS(LCDDATA19,0)
// LCDDATA22<SEG32COM3>
extern volatile __bit                   SEG32COM3           __at(0x3DB0);	// @ (0x7B6 * 8 + 0)
#define                                 SEG32COM3_bit       _BIT_ACCESS(LCDDATA22,0)
// PORTA<SEG33>
extern volatile __bit                   SEG33               __at(0x60);	// @ (0xC * 8 + 0)
#define                                 SEG33_bit           _BIT_ACCESS(PORTA,0)
// LCDDATA13<SEG33COM0>
extern volatile __bit                   SEG33COM0           __at(0x3D69);	// @ (0x7AD * 8 + 1)
#define                                 SEG33COM0_bit       _BIT_ACCESS(LCDDATA13,1)
// LCDDATA16<SEG33COM1>
extern volatile __bit                   SEG33COM1           __at(0x3D81);	// @ (0x7B0 * 8 + 1)
#define                                 SEG33COM1_bit       _BIT_ACCESS(LCDDATA16,1)
// LCDDATA19<SEG33COM2>
extern volatile __bit                   SEG33COM2           __at(0x3D99);	// @ (0x7B3 * 8 + 1)
#define                                 SEG33COM2_bit       _BIT_ACCESS(LCDDATA19,1)
// LCDDATA22<SEG33COM3>
extern volatile __bit                   SEG33COM3           __at(0x3DB1);	// @ (0x7B6 * 8 + 1)
#define                                 SEG33COM3_bit       _BIT_ACCESS(LCDDATA22,1)
// PORTA<SEG34>
extern volatile __bit                   SEG34               __at(0x62);	// @ (0xC * 8 + 2)
#define                                 SEG34_bit           _BIT_ACCESS(PORTA,2)
// LCDDATA13<SEG34COM0>
extern volatile __bit                   SEG34COM0           __at(0x3D6A);	// @ (0x7AD * 8 + 2)
#define                                 SEG34COM0_bit       _BIT_ACCESS(LCDDATA13,2)
// LCDDATA16<SEG34COM1>
extern volatile __bit                   SEG34COM1           __at(0x3D82);	// @ (0x7B0 * 8 + 2)
#define                                 SEG34COM1_bit       _BIT_ACCESS(LCDDATA16,2)
// LCDDATA19<SEG34COM2>
extern volatile __bit                   SEG34COM2           __at(0x3D9A);	// @ (0x7B3 * 8 + 2)
#define                                 SEG34COM2_bit       _BIT_ACCESS(LCDDATA19,2)
// LCDDATA22<SEG34COM3>
extern volatile __bit                   SEG34COM3           __at(0x3DB2);	// @ (0x7B6 * 8 + 2)
#define                                 SEG34COM3_bit       _BIT_ACCESS(LCDDATA22,2)
// PORTA<SEG35>
extern volatile __bit                   SEG35               __at(0x63);	// @ (0xC * 8 + 3)
#define                                 SEG35_bit           _BIT_ACCESS(PORTA,3)
// LCDDATA13<SEG35COM0>
extern volatile __bit                   SEG35COM0           __at(0x3D6B);	// @ (0x7AD * 8 + 3)
#define                                 SEG35COM0_bit       _BIT_ACCESS(LCDDATA13,3)
// LCDDATA16<SEG35COM1>
extern volatile __bit                   SEG35COM1           __at(0x3D83);	// @ (0x7B0 * 8 + 3)
#define                                 SEG35COM1_bit       _BIT_ACCESS(LCDDATA16,3)
// LCDDATA19<SEG35COM2>
extern volatile __bit                   SEG35COM2           __at(0x3D9B);	// @ (0x7B3 * 8 + 3)
#define                                 SEG35COM2_bit       _BIT_ACCESS(LCDDATA19,3)
// LCDDATA22<SEG35COM3>
extern volatile __bit                   SEG35COM3           __at(0x3DB3);	// @ (0x7B6 * 8 + 3)
#define                                 SEG35COM3_bit       _BIT_ACCESS(LCDDATA22,3)
// PORTA<SEG36>
extern volatile __bit                   SEG36               __at(0x66);	// @ (0xC * 8 + 6)
#define                                 SEG36_bit           _BIT_ACCESS(PORTA,6)
// LCDDATA13<SEG36COM0>
extern volatile __bit                   SEG36COM0           __at(0x3D6C);	// @ (0x7AD * 8 + 4)
#define                                 SEG36COM0_bit       _BIT_ACCESS(LCDDATA13,4)
// LCDDATA16<SEG36COM1>
extern volatile __bit                   SEG36COM1           __at(0x3D84);	// @ (0x7B0 * 8 + 4)
#define                                 SEG36COM1_bit       _BIT_ACCESS(LCDDATA16,4)
// LCDDATA19<SEG36COM2>
extern volatile __bit                   SEG36COM2           __at(0x3D9C);	// @ (0x7B3 * 8 + 4)
#define                                 SEG36COM2_bit       _BIT_ACCESS(LCDDATA19,4)
// LCDDATA22<SEG36COM3>
extern volatile __bit                   SEG36COM3           __at(0x3DB4);	// @ (0x7B6 * 8 + 4)
#define                                 SEG36COM3_bit       _BIT_ACCESS(LCDDATA22,4)
// PORTA<SEG37>
extern volatile __bit                   SEG37               __at(0x67);	// @ (0xC * 8 + 7)
#define                                 SEG37_bit           _BIT_ACCESS(PORTA,7)
// LCDDATA13<SEG37COM0>
extern volatile __bit                   SEG37COM0           __at(0x3D6D);	// @ (0x7AD * 8 + 5)
#define                                 SEG37COM0_bit       _BIT_ACCESS(LCDDATA13,5)
// LCDDATA16<SEG37COM1>
extern volatile __bit                   SEG37COM1           __at(0x3D85);	// @ (0x7B0 * 8 + 5)
#define                                 SEG37COM1_bit       _BIT_ACCESS(LCDDATA16,5)
// LCDDATA19<SEG37COM2>
extern volatile __bit                   SEG37COM2           __at(0x3D9D);	// @ (0x7B3 * 8 + 5)
#define                                 SEG37COM2_bit       _BIT_ACCESS(LCDDATA19,5)
// LCDDATA22<SEG37COM3>
extern volatile __bit                   SEG37COM3           __at(0x3DB5);	// @ (0x7B6 * 8 + 5)
#define                                 SEG37COM3_bit       _BIT_ACCESS(LCDDATA22,5)
// PORTB<SEG38>
extern volatile __bit                   SEG38               __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 SEG38_bit           _BIT_ACCESS(PORTB,6)
// LCDDATA13<SEG38COM0>
extern volatile __bit                   SEG38COM0           __at(0x3D6E);	// @ (0x7AD * 8 + 6)
#define                                 SEG38COM0_bit       _BIT_ACCESS(LCDDATA13,6)
// LCDDATA16<SEG38COM1>
extern volatile __bit                   SEG38COM1           __at(0x3D86);	// @ (0x7B0 * 8 + 6)
#define                                 SEG38COM1_bit       _BIT_ACCESS(LCDDATA16,6)
// LCDDATA19<SEG38COM2>
extern volatile __bit                   SEG38COM2           __at(0x3D9E);	// @ (0x7B3 * 8 + 6)
#define                                 SEG38COM2_bit       _BIT_ACCESS(LCDDATA19,6)
// LCDDATA22<SEG38COM3>
extern volatile __bit                   SEG38COM3           __at(0x3DB6);	// @ (0x7B6 * 8 + 6)
#define                                 SEG38COM3_bit       _BIT_ACCESS(LCDDATA22,6)
// PORTB<SEG39>
extern volatile __bit                   SEG39               __at(0x6F);	// @ (0xD * 8 + 7)
#define                                 SEG39_bit           _BIT_ACCESS(PORTB,7)
// LCDDATA13<SEG39COM0>
extern volatile __bit                   SEG39COM0           __at(0x3D6F);	// @ (0x7AD * 8 + 7)
#define                                 SEG39COM0_bit       _BIT_ACCESS(LCDDATA13,7)
// LCDDATA16<SEG39COM1>
extern volatile __bit                   SEG39COM1           __at(0x3D87);	// @ (0x7B0 * 8 + 7)
#define                                 SEG39COM1_bit       _BIT_ACCESS(LCDDATA16,7)
// LCDDATA19<SEG39COM2>
extern volatile __bit                   SEG39COM2           __at(0x3D9F);	// @ (0x7B3 * 8 + 7)
#define                                 SEG39COM2_bit       _BIT_ACCESS(LCDDATA19,7)
// LCDDATA22<SEG39COM3>
extern volatile __bit                   SEG39COM3           __at(0x3DB7);	// @ (0x7B6 * 8 + 7)
#define                                 SEG39COM3_bit       _BIT_ACCESS(LCDDATA22,7)
// LCDDATA0<SEG3COM0>
extern volatile __bit                   SEG3COM0            __at(0x3D03);	// @ (0x7A0 * 8 + 3)
#define                                 SEG3COM0_bit        _BIT_ACCESS(LCDDATA0,3)
// LCDDATA3<SEG3COM1>
extern volatile __bit                   SEG3COM1            __at(0x3D1B);	// @ (0x7A3 * 8 + 3)
#define                                 SEG3COM1_bit        _BIT_ACCESS(LCDDATA3,3)
// LCDDATA6<SEG3COM2>
extern volatile __bit                   SEG3COM2            __at(0x3D33);	// @ (0x7A6 * 8 + 3)
#define                                 SEG3COM2_bit        _BIT_ACCESS(LCDDATA6,3)
// LCDDATA9<SEG3COM3>
extern volatile __bit                   SEG3COM3            __at(0x3D4B);	// @ (0x7A9 * 8 + 3)
#define                                 SEG3COM3_bit        _BIT_ACCESS(LCDDATA9,3)
// PORTD<SEG4>
extern volatile __bit                   SEG4                __at(0x7C);	// @ (0xF * 8 + 4)
