MikroElektronika/core_packages/PIC/XC8/def/PIC16F1946/mcu.h
#define                                 SEG4_bit            _BIT_ACCESS(PORTD,4)
// PORTC<SEG40>
extern volatile __bit                   SEG40               __at(0x70);	// @ (0xE * 8 + 0)
#define                                 SEG40_bit           _BIT_ACCESS(PORTC,0)
// LCDDATA14<SEG40COM0>
extern volatile __bit                   SEG40COM0           __at(0x3D70);	// @ (0x7AE * 8 + 0)
#define                                 SEG40COM0_bit       _BIT_ACCESS(LCDDATA14,0)
// LCDDATA17<SEG40COM1>
extern volatile __bit                   SEG40COM1           __at(0x3D88);	// @ (0x7B1 * 8 + 0)
#define                                 SEG40COM1_bit       _BIT_ACCESS(LCDDATA17,0)
// LCDDATA20<SEG40COM2>
extern volatile __bit                   SEG40COM2           __at(0x3DA0);	// @ (0x7B4 * 8 + 0)
#define                                 SEG40COM2_bit       _BIT_ACCESS(LCDDATA20,0)
// LCDDATA23<SEG40COM3>
extern volatile __bit                   SEG40COM3           __at(0x3DB8);	// @ (0x7B7 * 8 + 0)
#define                                 SEG40COM3_bit       _BIT_ACCESS(LCDDATA23,0)
// PORTF<SEG41>
extern volatile __bit                   SEG41               __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 SEG41_bit           _BIT_ACCESS(PORTF,0)
// LCDDATA14<SEG41COM0>
extern volatile __bit                   SEG41COM0           __at(0x3D71);	// @ (0x7AE * 8 + 1)
#define                                 SEG41COM0_bit       _BIT_ACCESS(LCDDATA14,1)
// LCDDATA17<SEG41COM1>
extern volatile __bit                   SEG41COM1           __at(0x3D89);	// @ (0x7B1 * 8 + 1)
#define                                 SEG41COM1_bit       _BIT_ACCESS(LCDDATA17,1)
// LCDDATA20<SEG41COM2>
extern volatile __bit                   SEG41COM2           __at(0x3DA1);	// @ (0x7B4 * 8 + 1)
#define                                 SEG41COM2_bit       _BIT_ACCESS(LCDDATA20,1)
// LCDDATA23<SEG41COM3>
extern volatile __bit                   SEG41COM3           __at(0x3DB9);	// @ (0x7B7 * 8 + 1)
#define                                 SEG41COM3_bit       _BIT_ACCESS(LCDDATA23,1)
// PORTG<SEG42>
extern volatile __bit                   SEG42               __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 SEG42_bit           _BIT_ACCESS(PORTG,0)
// LCDDATA14<SEG42COM0>
extern volatile __bit                   SEG42COM0           __at(0x3D72);	// @ (0x7AE * 8 + 2)
#define                                 SEG42COM0_bit       _BIT_ACCESS(LCDDATA14,2)
// LCDDATA17<SEG42COM1>
extern volatile __bit                   SEG42COM1           __at(0x3D8A);	// @ (0x7B1 * 8 + 2)
#define                                 SEG42COM1_bit       _BIT_ACCESS(LCDDATA17,2)
// LCDDATA20<SEG42COM2>
extern volatile __bit                   SEG42COM2           __at(0x3DA2);	// @ (0x7B4 * 8 + 2)
#define                                 SEG42COM2_bit       _BIT_ACCESS(LCDDATA20,2)
// LCDDATA23<SEG42COM3>
extern volatile __bit                   SEG42COM3           __at(0x3DBA);	// @ (0x7B7 * 8 + 2)
#define                                 SEG42COM3_bit       _BIT_ACCESS(LCDDATA23,2)
// PORTG<SEG43>
extern volatile __bit                   SEG43               __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 SEG43_bit           _BIT_ACCESS(PORTG,1)
// LCDDATA14<SEG43COM0>
extern volatile __bit                   SEG43COM0           __at(0x3D73);	// @ (0x7AE * 8 + 3)
#define                                 SEG43COM0_bit       _BIT_ACCESS(LCDDATA14,3)
// LCDDATA17<SEG43COM1>
extern volatile __bit                   SEG43COM1           __at(0x3D8B);	// @ (0x7B1 * 8 + 3)
#define                                 SEG43COM1_bit       _BIT_ACCESS(LCDDATA17,3)
// LCDDATA20<SEG43COM2>
extern volatile __bit                   SEG43COM2           __at(0x3DA3);	// @ (0x7B4 * 8 + 3)
#define                                 SEG43COM2_bit       _BIT_ACCESS(LCDDATA20,3)
// LCDDATA23<SEG43COM3>
extern volatile __bit                   SEG43COM3           __at(0x3DBB);	// @ (0x7B7 * 8 + 3)
#define                                 SEG43COM3_bit       _BIT_ACCESS(LCDDATA23,3)
// PORTG<SEG44>
extern volatile __bit                   SEG44               __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 SEG44_bit           _BIT_ACCESS(PORTG,2)
// LCDDATA14<SEG44COM0>
extern volatile __bit                   SEG44COM0           __at(0x3D74);	// @ (0x7AE * 8 + 4)
#define                                 SEG44COM0_bit       _BIT_ACCESS(LCDDATA14,4)
// LCDDATA17<SEG44COM1>
extern volatile __bit                   SEG44COM1           __at(0x3D8C);	// @ (0x7B1 * 8 + 4)
#define                                 SEG44COM1_bit       _BIT_ACCESS(LCDDATA17,4)
// LCDDATA20<SEG44COM2>
extern volatile __bit                   SEG44COM2           __at(0x3DA4);	// @ (0x7B4 * 8 + 4)
#define                                 SEG44COM2_bit       _BIT_ACCESS(LCDDATA20,4)
// LCDDATA23<SEG44COM3>
extern volatile __bit                   SEG44COM3           __at(0x3DBC);	// @ (0x7B7 * 8 + 4)
#define                                 SEG44COM3_bit       _BIT_ACCESS(LCDDATA23,4)
// PORTG<SEG45>
extern volatile __bit                   SEG45               __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 SEG45_bit           _BIT_ACCESS(PORTG,3)
// LCDDATA14<SEG45COM0>
extern volatile __bit                   SEG45COM0           __at(0x3D75);	// @ (0x7AE * 8 + 5)
#define                                 SEG45COM0_bit       _BIT_ACCESS(LCDDATA14,5)
// LCDDATA17<SEG45COM1>
extern volatile __bit                   SEG45COM1           __at(0x3D8D);	// @ (0x7B1 * 8 + 5)
#define                                 SEG45COM1_bit       _BIT_ACCESS(LCDDATA17,5)
// LCDDATA20<SEG45COM2>
extern volatile __bit                   SEG45COM2           __at(0x3DA5);	// @ (0x7B4 * 8 + 5)
#define                                 SEG45COM2_bit       _BIT_ACCESS(LCDDATA20,5)
// LCDDATA23<SEG45COM3>
extern volatile __bit                   SEG45COM3           __at(0x3DBD);	// @ (0x7B7 * 8 + 5)
#define                                 SEG45COM3_bit       _BIT_ACCESS(LCDDATA23,5)
// LCDDATA0<SEG4COM0>
extern volatile __bit                   SEG4COM0            __at(0x3D04);	// @ (0x7A0 * 8 + 4)
#define                                 SEG4COM0_bit        _BIT_ACCESS(LCDDATA0,4)
// LCDDATA3<SEG4COM1>
extern volatile __bit                   SEG4COM1            __at(0x3D1C);	// @ (0x7A3 * 8 + 4)
#define                                 SEG4COM1_bit        _BIT_ACCESS(LCDDATA3,4)
// LCDDATA6<SEG4COM2>
extern volatile __bit                   SEG4COM2            __at(0x3D34);	// @ (0x7A6 * 8 + 4)
#define                                 SEG4COM2_bit        _BIT_ACCESS(LCDDATA6,4)
// LCDDATA9<SEG4COM3>
extern volatile __bit                   SEG4COM3            __at(0x3D4C);	// @ (0x7A9 * 8 + 4)
#define                                 SEG4COM3_bit        _BIT_ACCESS(LCDDATA9,4)
// PORTD<SEG5>
extern volatile __bit                   SEG5                __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 SEG5_bit            _BIT_ACCESS(PORTD,5)
// LCDDATA0<SEG5COM0>
extern volatile __bit                   SEG5COM0            __at(0x3D05);	// @ (0x7A0 * 8 + 5)
#define                                 SEG5COM0_bit        _BIT_ACCESS(LCDDATA0,5)
// LCDDATA3<SEG5COM1>
extern volatile __bit                   SEG5COM1            __at(0x3D1D);	// @ (0x7A3 * 8 + 5)
#define                                 SEG5COM1_bit        _BIT_ACCESS(LCDDATA3,5)
// LCDDATA6<SEG5COM2>
extern volatile __bit                   SEG5COM2            __at(0x3D35);	// @ (0x7A6 * 8 + 5)
#define                                 SEG5COM2_bit        _BIT_ACCESS(LCDDATA6,5)
// LCDDATA9<SEG5COM3>
extern volatile __bit                   SEG5COM3            __at(0x3D4D);	// @ (0x7A9 * 8 + 5)
#define                                 SEG5COM3_bit        _BIT_ACCESS(LCDDATA9,5)
// PORTD<SEG6>
extern volatile __bit                   SEG6                __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 SEG6_bit            _BIT_ACCESS(PORTD,6)
// LCDDATA0<SEG6COM0>
extern volatile __bit                   SEG6COM0            __at(0x3D06);	// @ (0x7A0 * 8 + 6)
#define                                 SEG6COM0_bit        _BIT_ACCESS(LCDDATA0,6)
// LCDDATA3<SEG6COM1>
extern volatile __bit                   SEG6COM1            __at(0x3D1E);	// @ (0x7A3 * 8 + 6)
#define                                 SEG6COM1_bit        _BIT_ACCESS(LCDDATA3,6)
// LCDDATA6<SEG6COM2>
extern volatile __bit                   SEG6COM2            __at(0x3D36);	// @ (0x7A6 * 8 + 6)
#define                                 SEG6COM2_bit        _BIT_ACCESS(LCDDATA6,6)
// LCDDATA9<SEG6COM3>
extern volatile __bit                   SEG6COM3            __at(0x3D4E);	// @ (0x7A9 * 8 + 6)
#define                                 SEG6COM3_bit        _BIT_ACCESS(LCDDATA9,6)
// PORTD<SEG7>
extern volatile __bit                   SEG7                __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 SEG7_bit            _BIT_ACCESS(PORTD,7)
// LCDDATA0<SEG7COM0>
extern volatile __bit                   SEG7COM0            __at(0x3D07);	// @ (0x7A0 * 8 + 7)
#define                                 SEG7COM0_bit        _BIT_ACCESS(LCDDATA0,7)
// LCDDATA3<SEG7COM1>
extern volatile __bit                   SEG7COM1            __at(0x3D1F);	// @ (0x7A3 * 8 + 7)
#define                                 SEG7COM1_bit        _BIT_ACCESS(LCDDATA3,7)
// LCDDATA6<SEG7COM2>
extern volatile __bit                   SEG7COM2            __at(0x3D37);	// @ (0x7A6 * 8 + 7)
#define                                 SEG7COM2_bit        _BIT_ACCESS(LCDDATA6,7)
// LCDDATA9<SEG7COM3>
extern volatile __bit                   SEG7COM3            __at(0x3D4F);	// @ (0x7A9 * 8 + 7)
#define                                 SEG7COM3_bit        _BIT_ACCESS(LCDDATA9,7)
// PORTB<SEG8>
extern volatile __bit                   SEG8                __at(0x69);	// @ (0xD * 8 + 1)
#define                                 SEG8_bit            _BIT_ACCESS(PORTB,1)
// LCDDATA1<SEG8COM0>
extern volatile __bit                   SEG8COM0            __at(0x3D08);	// @ (0x7A1 * 8 + 0)
#define                                 SEG8COM0_bit        _BIT_ACCESS(LCDDATA1,0)
// LCDDATA4<SEG8COM1>
extern volatile __bit                   SEG8COM1            __at(0x3D20);	// @ (0x7A4 * 8 + 0)
#define                                 SEG8COM1_bit        _BIT_ACCESS(LCDDATA4,0)
// LCDDATA7<SEG8COM2>
extern volatile __bit                   SEG8COM2            __at(0x3D38);	// @ (0x7A7 * 8 + 0)
#define                                 SEG8COM2_bit        _BIT_ACCESS(LCDDATA7,0)
// LCDDATA10<SEG8COM3>
extern volatile __bit                   SEG8COM3            __at(0x3D50);	// @ (0x7AA * 8 + 0)
#define                                 SEG8COM3_bit        _BIT_ACCESS(LCDDATA10,0)
// PORTB<SEG9>
extern volatile __bit                   SEG9                __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 SEG9_bit            _BIT_ACCESS(PORTB,2)
// LCDDATA1<SEG9COM0>
extern volatile __bit                   SEG9COM0            __at(0x3D09);	// @ (0x7A1 * 8 + 1)
#define                                 SEG9COM0_bit        _BIT_ACCESS(LCDDATA1,1)
// LCDDATA4<SEG9COM1>
extern volatile __bit                   SEG9COM1            __at(0x3D21);	// @ (0x7A4 * 8 + 1)
#define                                 SEG9COM1_bit        _BIT_ACCESS(LCDDATA4,1)
// LCDDATA7<SEG9COM2>
extern volatile __bit                   SEG9COM2            __at(0x3D39);	// @ (0x7A7 * 8 + 1)
#define                                 SEG9COM2_bit        _BIT_ACCESS(LCDDATA7,1)
// LCDDATA10<SEG9COM3>
extern volatile __bit                   SEG9COM3            __at(0x3D51);	// @ (0x7AA * 8 + 1)
#define                                 SEG9COM3_bit        _BIT_ACCESS(LCDDATA10,1)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x3C8E);	// @ (0x791 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// SRCON0<SRCLK0>
extern volatile __bit                   SRCLK0              __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 SRCLK0_bit          _BIT_ACCESS(SRCON0,4)
// SRCON0<SRCLK1>
extern volatile __bit                   SRCLK1              __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 SRCLK1_bit          _BIT_ACCESS(SRCON0,5)
// SRCON0<SRCLK2>
extern volatile __bit                   SRCLK2              __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 SRCLK2_bit          _BIT_ACCESS(SRCON0,6)
// PORTB<SRI>
extern volatile __bit                   SRI                 __at(0x68);	// @ (0xD * 8 + 0)
#define                                 SRI_bit             _BIT_ACCESS(PORTB,0)
// SRCON0<SRLEN>
extern volatile __bit                   SRLEN               __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 SRLEN_bit           _BIT_ACCESS(SRCON0,7)
// PORTF<SRNQ>
extern volatile __bit                   SRNQ                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 SRNQ_bit            _BIT_ACCESS(PORTF,1)
// SRCON0<SRNQEN>
extern volatile __bit                   SRNQEN              __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 SRNQEN_bit          _BIT_ACCESS(SRCON0,2)
// SRCON0<SRPR>
extern volatile __bit                   SRPR                __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 SRPR_bit            _BIT_ACCESS(SRCON0,0)
// SRCON0<SRPS>
extern volatile __bit                   SRPS                __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 SRPS_bit            _BIT_ACCESS(SRCON0,1)
// PORTF<SRQ>
extern volatile __bit                   SRQ                 __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 SRQ_bit             _BIT_ACCESS(PORTF,2)
// SRCON0<SRQEN>
extern volatile __bit                   SRQEN               __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 SRQEN_bit           _BIT_ACCESS(SRCON0,3)
// SRCON1<SRRC1E>
extern volatile __bit                   SRRC1E              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 SRRC1E_bit          _BIT_ACCESS(SRCON1,0)
// SRCON1<SRRC2E>
extern volatile __bit                   SRRC2E              __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 SRRC2E_bit          _BIT_ACCESS(SRCON1,1)
// SRCON1<SRRCKE>
extern volatile __bit                   SRRCKE              __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 SRRCKE_bit          _BIT_ACCESS(SRCON1,2)
// SRCON1<SRRPE>
extern volatile __bit                   SRRPE               __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 SRRPE_bit           _BIT_ACCESS(SRCON1,3)
// SRCON1<SRSC1E>
extern volatile __bit                   SRSC1E              __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 SRSC1E_bit          _BIT_ACCESS(SRCON1,4)
// SRCON1<SRSC2E>
extern volatile __bit                   SRSC2E              __at(0x8DD);	// @ (0x11B * 8 + 5)
#define                                 SRSC2E_bit          _BIT_ACCESS(SRCON1,5)
// SRCON1<SRSCKE>
extern volatile __bit                   SRSCKE              __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 SRSCKE_bit          _BIT_ACCESS(SRCON1,6)
// SRCON1<SRSPE>
extern volatile __bit                   SRSPE               __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 SRSPE_bit           _BIT_ACCESS(SRCON1,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// PIE4<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x4A0);	// @ (0x94 * 8 + 0)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0xA0);	// @ (0x14 * 8 + 0)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR4,0)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// PSTR1CON<STR1A>
extern volatile __bit                   STR1A               __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 STR1A_bit           _BIT_ACCESS(PSTR1CON,0)
// PSTR1CON<STR1B>
extern volatile __bit                   STR1B               __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 STR1B_bit           _BIT_ACCESS(PSTR1CON,1)
// PSTR1CON<STR1C>
extern volatile __bit                   STR1C               __at(0x14B2);	// @ (0x296 * 8 + 2)
#define                                 STR1C_bit           _BIT_ACCESS(PSTR1CON,2)
// PSTR1CON<STR1D>
extern volatile __bit                   STR1D               __at(0x14B3);	// @ (0x296 * 8 + 3)
#define                                 STR1D_bit           _BIT_ACCESS(PSTR1CON,3)
// PSTR1CON<STR1SYNC>
extern volatile __bit                   STR1SYNC            __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 STR1SYNC_bit        _BIT_ACCESS(PSTR1CON,4)
// PSTR2CON<STR2A>
extern volatile __bit                   STR2A               __at(0x14E8);	// @ (0x29D * 8 + 0)
#define                                 STR2A_bit           _BIT_ACCESS(PSTR2CON,0)
// PSTR2CON<STR2B>
extern volatile __bit                   STR2B               __at(0x14E9);	// @ (0x29D * 8 + 1)
#define                                 STR2B_bit           _BIT_ACCESS(PSTR2CON,1)
// PSTR2CON<STR2C>
extern volatile __bit                   STR2C               __at(0x14EA);	// @ (0x29D * 8 + 2)
#define                                 STR2C_bit           _BIT_ACCESS(PSTR2CON,2)
// PSTR2CON<STR2D>
extern volatile __bit                   STR2D               __at(0x14EB);	// @ (0x29D * 8 + 3)
#define                                 STR2D_bit           _BIT_ACCESS(PSTR2CON,3)
// PSTR2CON<STR2SYNC>
extern volatile __bit                   STR2SYNC            __at(0x14EC);	// @ (0x29D * 8 + 4)
#define                                 STR2SYNC_bit        _BIT_ACCESS(PSTR2CON,4)
// PSTR3CON<STR3A>
extern volatile __bit                   STR3A               __at(0x18B0);	// @ (0x316 * 8 + 0)
#define                                 STR3A_bit           _BIT_ACCESS(PSTR3CON,0)
// PSTR3CON<STR3B>
extern volatile __bit                   STR3B               __at(0x18B1);	// @ (0x316 * 8 + 1)
#define                                 STR3B_bit           _BIT_ACCESS(PSTR3CON,1)
// PSTR3CON<STR3C>
extern volatile __bit                   STR3C               __at(0x18B2);	// @ (0x316 * 8 + 2)
#define                                 STR3C_bit           _BIT_ACCESS(PSTR3CON,2)
// PSTR3CON<STR3D>
extern volatile __bit                   STR3D               __at(0x18B3);	// @ (0x316 * 8 + 3)
#define                                 STR3D_bit           _BIT_ACCESS(PSTR3CON,3)
// PSTR3CON<STR3SYNC>
extern volatile __bit                   STR3SYNC            __at(0x18B4);	// @ (0x316 * 8 + 4)
#define                                 STR3SYNC_bit        _BIT_ACCESS(PSTR3CON,4)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// PORTA<T0CKI>
extern volatile __bit                   T0CKI               __at(0x64);	// @ (0xC * 8 + 4)
#define                                 T0CKI_bit           _BIT_ACCESS(PORTA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// CPSCON0<T0XCS>
extern volatile __bit                   T0XCS               __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 T0XCS_bit           _BIT_ACCESS(CPSCON0,0)
// PORTC<T1CKI>
extern volatile __bit                   T1CKI               __at(0x70);	// @ (0xE * 8 + 0)
#define                                 T1CKI_bit           _BIT_ACCESS(PORTC,0)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// PORTB<T1G>
extern volatile __bit                   T1G                 __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 T1G_bit             _BIT_ACCESS(PORTB,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_nDONE>
extern volatile __bit                   T1GGO_nDONE         __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_nDONE_bit     _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0xCE);	// @ (0x19 * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0xCC);	// @ (0x19 * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0xC8);	// @ (0x19 * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0xC9);	// @ (0x19 * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0xCD);	// @ (0x19 * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0xCA);	// @ (0x19 * 8 + 2)
